[
  {
    "id": 1,
    "line": "Are you a wireframe? Because I can see the structure of my future with you."
  },
  {
    "id": 2,
    "line": "You must be made with Figma, because you've got all the right curves and constraints."
  },
  {
    "id": 3,
    "line": "Are you Helvetica? Because you're exactly my type."
  },
  {
    "id": 4,
    "line": "You must be a Bezier curve, because you bend my heart in all the right ways."
  },
  {
    "id": 5,
    "line": "I’d never ghost you—unless it’s a layer in Photoshop."
  },
  {
    "id": 6,
    "line": "You must be a UI component, because I want to reuse you in all my projects."
  },
  {
    "id": 7,
    "line": "You're the grid to my layout, perfectly aligned in my life."
  },
  {
    "id": 8,
    "line": "Are you a color palette? Because you brighten up my entire world."
  },
  {
    "id": 9,
    "line": "You auto-layout my heart every time you smile."
  },
  {
    "id": 10,
    "line": "Let’s make a prototype—so I can show you how we work together."
  },
  {
    "id": 11,
    "line": "Are you a mockup? Because you make my rough ideas look amazing."
  },
  {
    "id": 12,
    "line": "You're not a bug, you're a feature I didn't know I needed."
  },
  {
    "id": 13,
    "line": "You must be Adobe XD, because every interaction with you feels like magic."
  },
  {
    "id": 14,
    "line": "Are you responsive? Because you adapt perfectly to every situation."
  },
  {
    "id": 15,
    "line": "Even my drop shadows fall for you."
  },
  {
    "id": 16,
    "line": "Are you a prototype? Because I can’t wait to turn you into something real."
  },
  {
    "id": 17,
    "line": "You're like a bold font — you stand out in every crowd."
  },
  {
    "id": 18,
    "line": "I must be using a blur effect, because I’m lost in your focus."
  },
  {
    "id": 19,
    "line": "If you were a CSS class, you’d be .perfect-alignment."
  },
  {
    "id": 20,
    "line": "You're better than a high-res mockup — you're the final build."
  },
  {
    "id": 21,
    "line": "You must be a drop shadow, because you give me depth."
  },
  {
    "id": 22,
    "line": "Are you a gradient? Because you're making my life blend beautifully."
  },
  {
    "id": 23,
    "line": "I’d kerning closer to you any day."
  },
  {
    "id": 24,
    "line": "You’re the white space in my chaotic life."
  },
  {
    "id": 25,
    "line": "You're like a well-designed logo — unforgettable and iconic."
  },
  {
    "id": 26,
    "line": "Your alignment must be center — because you're always on point."
  },
  {
    "id": 27,
    "line": "If I were a font, I’d want to be paired with you forever."
  },
  {
    "id": 28,
    "line": "I’d never put you in a frame — you’re the whole canvas."
  },
  {
    "id": 29,
    "line": "I love the way you handle negative space — especially when I’m missing you."
  },
  {
    "id": 30,
    "line": "You must be in vector format — flawless at any scale."
  }
]
