[
  {
    "id": 1,
    "line": "நீ சிரிக்குற போது, Google லா 'Brightest Smile in the World' update பண்ணுறாங்க!",
    "meaning": "When you smile, even Google updates its 'Brightest Smile in the World'."
  },
  {
    "id": 2,
    "line": "நீயா ரோஜா? இல்லையென்றா என் நெஞ்சுக்குள்ள யாரு பூத்திருக்காங்க?",
    "meaning": "Are you a rose? If not, who bloomed inside my heart?"
  },
  {
    "id": 3,
    "line": "நீ பேசுற ஒவ்வொரு வார்த்தைக்கும் என் Heartbeat ஒரு Skip ஆகுது!",
    "meaning": "Each word you speak skips a beat in my heart!"
  },
  {
    "id": 4,
    "line": "நீ சிரிச்சா Signal green ஆகும் மாதிரி தான் என் Mood Happy ஆகுது!",
    "meaning": "Your smile turns my mood green like a traffic light!"
  },
  {
    "id": 5,
    "line": "உன்ன பாக்குறதுக்கு OTP வேணாம், என் கண்ணே Open Ticket!",
    "meaning": "To see you, I don’t need an OTP — my eyes are always open!"
  },
  {
    "id": 6,
    "line": "நீயும் ChatGPT மாதிரி தான்… என்ன சொல்ல போறேன்னு யாருக்கும் புரியாத அழகு!",
    "meaning": "You're like ChatGPT — beautifully unpredictable!"
  },
  {
    "id": 7,
    "line": "நீ Smile பண்ணாலே, என் Battery 100% charge ஆகுது!",
    "meaning": "Your smile charges my heart like a battery!"
  },
  {
    "id": 8,
    "line": "உன்ன பாத்ததும் நான் உங்கள வாத்தி பாடலில் தேட ஆரம்பிச்சுட்டேன்!",
    "meaning": "After seeing you, I started searching for you in every 'Vaathi' song!"
  },
  {
    "id": 9,
    "line": "நீ என் Wi-Fi password போல — எனக்கு மட்டும் தெரிஞ்சிருந்தா போதும்!",
    "meaning": "You’re like my Wi-Fi password — better if only I know you!"
  },
  {
    "id": 10,
    "line": "பூ பூக்கும் காலம் வரலன்னா பரவாயில்ல… நீ இருக்கே!",
    "meaning": "Even if the season of flowers doesn't come — you’re enough!"
  },
  [
    {
      "id": 11,
      "line": "நீ பேசுற ஒவ்வொரு வார்த்தையும் காதல் கவிதை மாதிரி இருக்கு!",
      "meaning": "Every word you speak feels like a love poem!"
    },
    {
      "id": 12,
      "line": "நீ இல்லாம இருக்கற நாள்… Google Map-லே பாத்தா 'Lost' தான் காட்டுது!",
      "meaning": "The day you're not around, even Google Maps says I'm lost!"
    },
    {
      "id": 13,
      "line": "நீ ஒரு வீரம் தான்… என்னாலயே எதிர்ப்பது முடியல!",
      "meaning": "You're like a storm — I can't resist you!"
    },
    {
      "id": 14,
      "line": "நீ எனக்கு Coffee மாதிரி… நாள் முழுக்க Fresh ஆ வச்சுற!",
      "meaning": "You're like coffee — you keep me fresh all day!"
    },
    {
      "id": 15,
      "line": "உன் கண்ணில் ஒரு Magic இருக்கு… அது தான் என் Logic-ஐ கிளியராயிட் பண்ணுது!",
      "meaning": "There’s magic in your eyes — it clears all my logic!"
    },
    {
      "id": 16,
      "line": "நீ சிரிச்சா, மழை வரும்னு Clouds கூட சந்தோஷப்படுது!",
      "meaning": "Even the clouds get happy thinking it might rain when you smile!"
    },
    {
      "id": 17,
      "line": "நீ இல்லாமல் ஒரு நாள் கூட கடிகாரம் நகரவே மாட்டேங்கற மாதிரி இருக்கு!",
      "meaning": "Without you, time itself refuses to move!"
    },
    {
      "id": 18,
      "line": "நீன்னா யாரு? Netflix-க்கும் YouTube-க்கும் போட்டியா இருக்க!",
      "meaning": "Who are you? Competing with Netflix and YouTube for my attention!"
    },
    {
      "id": 19,
      "line": "உன்னைப் பாக்கிறேன் என்றே My Screen Time அதிகமாயிடுச்சு!",
      "meaning": "Just watching you has increased my screen time!"
    },
    {
      "id": 20,
      "line": "நீ பேசுனா தான் என் Heartbeat Bluetooth-ல் Connect ஆகுது!",
      "meaning": "My heartbeat only connects via Bluetooth when you speak!"
    },
    {
      "id": 21,
      "line": "நீயே எனக்கு தேவதைன்னு சொல்லாம இருக்க முடியாதே!",
      "meaning": "I can’t stop calling you my angel!"
    },
    {
      "id": 22,
      "line": "உன்னை பாக்குறதுக்காக WhatsApp Status Check பண்ணுற அளவுக்கு பழக்கமாச்சு!",
      "meaning": "I’ve gotten used to checking your WhatsApp status just to see you!"
    },
    {
      "id": 23,
      "line": "நீ சிரிச்சா தான், நான் 24fps-ல வாழ்றேன்!",
      "meaning": "I start living in full frames only when you smile!"
    },
    {
      "id": 24,
      "line": "நீ பக்கத்துல இருந்தா AirPods கூட வேணாம்னு தோணுது!",
      "meaning": "When you're around, I don't even need AirPods!"
    },
    {
      "id": 25,
      "line": "உனக்காக Wait பண்ணுறேன்… Zoom Buffer ஆகுற மாதிரி!",
      "meaning": "I'm waiting for you like Zoom buffering — slow but steady!"
    },
    {
      "id": 26,
      "line": "நீ பேசுனா தான் என் Brain Code Compile ஆகுது!",
      "meaning": "Only when you speak does my brain compile the code properly!"
    },
    {
      "id": 27,
      "line": "நீ என் கனவுல வந்த பிறகு, Alarm-ல Snooze போடவே தோணல!",
      "meaning": "After you came in my dreams, I don’t even feel like snoozing the alarm!"
    },
    {
      "id": 28,
      "line": "உன்ன பாத்ததுக்குப் பிறகு, Instagram Explore-ல வேற யாரும் Attractive இல்ல!",
      "meaning": "After seeing you, even Insta Explore lost its charm!"
    },
    {
      "id": 29,
      "line": "உன்ன பாக்காம இருக்கற நாளே Invalid Input மாதிரி இருக்கு!",
      "meaning": "A day without seeing you feels like invalid input!"
    },
    {
      "id": 30,
      "line": "நீ என் Bio Data-வ படிச்சா, Last Line ‘Waiting for You’ தான்!",
      "meaning": "If you read my bio, the last line will be 'Waiting for you'."
    }
  ]
]
